{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v2.8.5", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of13.bin", "group1-shard2of13.bin", "group1-shard3of13.bin", "group1-shard4of13.bin", "group1-shard5of13.bin", "group1-shard6of13.bin", "group1-shard7of13.bin", "group1-shard8of13.bin", "group1-shard9of13.bin", "group1-shard10of13.bin", "group1-shard11of13.bin", "group1-shard12of13.bin", "group1-shard13of13.bin"], "weights": [{"name": "conv2d_92/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_92/bias", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_115/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_115/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_115/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_115/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv2d_93/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_93/bias", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_116/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_116/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_116/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_116/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv2d_94/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_94/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_95/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_95/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_117/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_117/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_117/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_117/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "dense_69/kernel", "shape": [25088, 512], "dtype": "float32"}, {"name": "dense_69/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_118/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_118/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_118/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_118/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "dense_70/kernel", "shape": [512, 128], "dtype": "float32"}, {"name": "dense_70/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_119/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_119/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_119/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_119/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "dense_71/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_71/bias", "shape": [10], "dtype": "float32"}]}]}